In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy import create_engine

In [2]:
revisit_engine = create_engine("mysql+pymysql://eums:eums00!q@133.186.146.142:3306/eums-cj-1-business?charset=utf8mb4", encoding = 'utf8' ,
                   pool_size=20,pool_recycle=3600,connect_args={'connect_timeout':1000000} )

In [3]:
company_engine = create_engine("mysql+pymysql://eums:eums00!q@133.186.146.142:3306/eums-poi?charset=utf8mb4", encoding = 'utf8' ,
                   pool_size=20,pool_recycle=3600,connect_args={'connect_timeout':1000000} )

In [ ]:
query = """
select ID, CO_NAME
from MEUMS_COMPANY
where (LATITUDE between 37.4991523 and 37.5035853 ) and (LONGITUDE between 127.02101190000008 and 127.03130480000004 ) and CATE1 = '카페'
"""

In [ ]:
company = pd.read_pickle("company_cafe.pkl")
company_id = company.ID #강남역 카페 를 pickle로 생성

<h3>cjcis15a3a19b96259ad1c6c84d112 case

In [6]:
query = """
select *
from MEUMS_COMP_REVISIT_HIS
where EPOPCON_ID = "cjcis15a397d6271e42756fbe8324f"
"""
user = pd.read_sql_query(query,revisit_engine)
user.head()

,ID,EPOPCON_ID,ES_ID,COMPANY_ID,TIMESTAMP,DEAL_DT,CARD_NAME,CARD_ID,CARD_APPR_NUM,PAYMENT,ISSUED_COMPANY_ID,DEAL_LOCATION,LIFEZONE_HIS_ID,TRANS_YN,REG_DT,UPT_DT
0,168657119,cjcis15a397d6271e42756fbe8324f,,5749271,1493180114000,2017-04-26 13:15:14,우리카드(5072),0,-1,8700,6,"0.0,0.0",-1,0,2018-04-26 11:58:28,2018-04-26 11:58:28
1,168657120,cjcis15a397d6271e42756fbe8324f,,8407173,1493182523000,2017-04-26 13:55:23,현대체크,0,-1,5500,0,"0.0,0.0",-1,0,2018-04-26 11:58:28,2018-04-26 11:58:28
2,168657121,cjcis15a397d6271e42756fbe8324f,,5749271,1493190056000,2017-04-26 16:00:56,우리카드(5072),0,-1,900,6,"0.0,0.0",-1,0,2018-04-26 11:58:28,2018-04-26 11:58:28
3,168657122,cjcis15a397d6271e42756fbe8324f,,5749271,1493193633000,2017-04-26 17:00:33,우리카드(5072),0,-1,9750,6,"0.0,0.0",-1,0,2018-04-26 11:58:28,2018-04-26 11:58:28
4,168657123,cjcis15a397d6271e42756fbe8324f,,6465857,1493271569000,2017-04-27 14:39:29,현대체크,0,-1,1700,0,"0.0,0.0",-1,0,2018-04-26 11:58:28,2018-04-26 11:58:28

In [7]:
com = []
for co_id in user.COMPANY_ID.unique():
    query = """
    select ID,CO_NAME,CATE,CATE1
    from MEUMS_COMPANY
    where ID = {}""".format(co_id)
    
    df = pd.read_sql_query(query, company_engine)
    com.append(df)
len(com)

652

In [8]:
com2 = pd.concat([i for i in com])
com2.head()

        ID      CO_NAME    CATE  CATE1
0  5749271  그린카 서울놀이마당점     자동차   카쉐어링
0  8407173      아프리카당구장  취미/스포츠  스포츠시설
0  6465857       학생회관매점      마트   슈퍼마켓
0  3642111           택시      교통     택시
0  8138566          커피안  카페/디저트     카페

In [9]:
tosee = user.merge(com2, left_on="COMPANY_ID", right_on="ID").sort_values(["EPOPCON_ID", "DEAL_DT"])

In [23]:
tosee.PAYMENT = tosee.PAYMENT.astype(int)

In [24]:
tosee2 = tosee[(tosee.DEAL_DT > '2018-04-01')&(tosee.DEAL_DT < '2018-05-01')]

In [25]:
tosee2.head()

,ID_x,EPOPCON_ID,ES_ID,COMPANY_ID,TIMESTAMP,DEAL_DT,CARD_NAME,CARD_ID,CARD_APPR_NUM,PAYMENT,ISSUED_COMPANY_ID,DEAL_LOCATION,LIFEZONE_HIS_ID,TRANS_YN,REG_DT,UPT_DT,ID_y,CO_NAME,CATE,CATE1
1797,168658960,cjcis15a397d6271e42756fbe8324f,,6234746,1522518240000,2018-04-01 02:44:00,우리카드(6126),0,-1,45000,6,"0.0,0.0",-1,0,2018-04-26 11:58:44,2018-04-26 11:58:44,6234746,호텔엠피에프브이(주),주거,부동산
186,168658961,cjcis15a397d6271e42756fbe8324f,,3642111,1522518243000,2018-04-01 02:44:03,우리카드(6126),0,-1,5400,6,"0.0,0.0",-1,0,2018-04-26 11:58:44,2018-04-26 11:58:44,3642111,택시,교통,택시
763,168658962,cjcis15a397d6271e42756fbe8324f,,1049532,1522567983000,2018-04-01 16:33:03,우리카드(6126),0,-1,5000,6,"0.0,0.0",-1,0,2018-04-26 11:58:44,2018-04-26 11:58:44,1049532,현대백화점 신촌점,백화점,백화점
1798,168658963,cjcis15a397d6271e42756fbe8324f,,23984,1522569049000,2018-04-01 16:50:49,현대체크,0,-1,13200,0,"0.0,0.0",-1,0,2018-04-26 11:58:44,2018-04-26 11:58:44,23984,CGV 신촌아트레온점,문화,영화
1799,168658965,cjcis15a397d6271e42756fbe8324f,,5404159,1522584009000,2018-04-01 21:00:09,현대체크,0,-1,16160,0,"0.0,0.0",-1,0,2018-04-26 11:58:44,2018-04-26 11:58:44,5404159,올리브영 종로2가점,뷰티,화장품

In [26]:
tosee2["CARD"] = tosee2.CARD_NAME.str[:2]

C:\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [28]:
tosee2.groupby("CARD").PAYMENT.sum().to_csv("card_alter.txt")

In [29]:
tosee2.groupby("CARD").PAYMENT.sum()

CARD
농협    218900
신한    271520
우리    872310
현대    547040
Name: PAYMENT, dtype: int32

In [30]:
tosee2["hour"] = tosee2.DEAL_DT.dt.hour

C:\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [31]:
tosee2.groupby("hour").PAYMENT.sum().to_csv("time_alter.txt")

In [32]:
tosee2.groupby("hour").PAYMENT.sum()

hour
0     198390
1     140720
2     202820
3      32780
4       3200
9      12090
13     31620
14     35200
15    215533
16    111800
17    155531
18     56660
19    102640
20     75756
21    255590
22    169900
23    109540
Name: PAYMENT, dtype: int32

In [18]:
tosee2[tosee2.CATE=='교육']

,ID_x,EPOPCON_ID,ES_ID,COMPANY_ID,TIMESTAMP,DEAL_DT,CARD_NAME,CARD_ID,CARD_APPR_NUM,PAYMENT,...,LIFEZONE_HIS_ID,TRANS_YN,REG_DT,UPT_DT,ID_y,CO_NAME,CATE,CATE1,CARD,hour
1680,170996816,cjcis15a397d6271e42756fbe8324f,,7319925,1524995521000,2018-04-29 18:52:01,현대체크,0,-1,37000,...,-1,0,2018-04-29 18:53:16,2018-04-29 18:53:16,7319925,카카오프렌즈 강남플래그십스토어,교육,사무용품,현대,18

In [ ]:
test_dict = {}
for cate in tosee.CATE:
    t = tosee[tosee.CATE == cate]
    r = t.resample('1M', on = 'DEAL_DT').PAYMENT.sum()
    test_dict.update({cate : r})
    
rel = []
for cate in list(test_dict.keys()):
    temp = pd.DataFrame(data = test_dict[cate].values, index = list(test_dict[cate].index), columns = [cate])
    rel.append(temp)
    
result_1Month = pd.concat([i for i in rel], axis = 1)
result_1Month.to_csv('6month_card.txt',sep="\t")

In [34]:
tosee2.groupby('CATE').PAYMENT.sum().to_csv('cate_alter.txt')

<h3> 신논현 역

In [57]:
query = """
select ID, CO_NAME
from MEUMS_COMPANY
where (LATITUDE between 37.5009881 and 37.5151893 ) and (LONGITUDE between 127.02007789999993 and 127.0325262 ) and (CO_NAME like '투썸%%')
"""
print(query)
company = pd.read_sql_query(query, company_engine)
company.to_pickle('company_cafe2.pkl')
company_id = company.ID #신논현 투썸플레이스를 pickle로 생성

select ID, CO_NAME
from MEUMS_COMPANY
where (LATITUDE between 37.5009881 and 37.5151893 ) and (LONGITUDE between 127.02007789999993 and 127.0325262 ) and (CO_NAME like '투썸%%')

In [58]:
company_id

0    7050134
1    8052874
2    8058801
3     946880
4    7959870
5     946909
6    5888571
7     947108
Name: ID, dtype: int64

In [60]:
c = 0
for e_id in company_id:
    query = """
    select COUNT(*) as COUNT
    from MEUMS_COMP_REVISIT_HIS
    where COMPANY_ID = {}""".format(e_id)
    
    count = pd.read_sql_query(query,revisit_engine)
    count = count.COUNT[0]
    if c < count:
        print(count, e_id)
        c = count

128 7050134
701 946880
746 7959870
1863 5888571

In [61]:
#투썸 플레이스 5888571

In [64]:
query = """
select *
from MEUMS_COMP_REVISIT_HIS
where COMPANY_ID = {}
""".format(5888571)

epopcon_id = pd.read_sql_query(query,revisit_engine)
epopcon_id.head()

,ID,EPOPCON_ID,ES_ID,COMPANY_ID,TIMESTAMP,DEAL_DT,CARD_NAME,CARD_ID,CARD_APPR_NUM,PAYMENT,ISSUED_COMPANY_ID,DEAL_LOCATION,LIFEZONE_HIS_ID,TRANS_YN,REG_DT,UPT_DT
0,89624642,cjcis15a38fa6ce946d9170e4b0700,,5888571,1513683562000,2017-12-19 20:39:22,KB국민체크(5*5*),0,-1,500,3,"0.0,0.0",-1,0,2017-12-19 20:41:38,2017-12-19 20:41:38
1,89628508,cjcis15a38fa6ce946d9170e4b0700,,5888571,1513684539000,2017-12-19 20:55:39,KB국민체크(5*5*),0,-1,10800,3,"0.0,0.0",-1,0,2017-12-19 20:55:54,2017-12-19 20:55:54
2,89712036,cjcis15a392ffb5a93f40965bc789f,,5888571,1512726175000,2017-12-08 18:42:55,현대카드M3,0,-1,13000,0,"0.0,0.0",-1,0,2017-12-20 06:49:37,2017-12-20 06:49:37
3,89859818,cjcis15a39c58f6259ad0a9e33f62d,,5888571,1489296901000,2017-03-12 14:35:01,삼성카드(4358),0,-1,11400,1,"0.0,0.0",-1,0,2017-12-20 11:25:11,2017-12-20 11:25:11
4,89860635,cjcis15a39c58f6259ad0a9e33f62d,,5888571,1504836344000,2017-09-08 11:05:44,삼성카드(4358),0,-1,9700,1,"0.0,0.0",-1,0,2017-12-20 11:25:14,2017-12-20 11:25:14

In [65]:
id_list = epopcon_id.groupby('EPOPCON_ID').size().sort_values(ascending = False)
id_list.index

Index(['cjcis15a39507171e42756fbe7fff5', 'cjcis15a3ae5a1e946d90511c9b1f8',
       'cjcis15a390ce45a93f40965bbf4b1', 'cjcis15a39c58f6259ad0a9e33f62d',
       'cjcis15a391545b267560d56e387c5', 'cjcis15a3aa4cbe4f196065e63cddb',
       'cjcis15a3a59cd6259ad1c6c851faa', 'cjcis15a3c82036259ad1c6c858cbb',
       'cjcis15a4bac0eb267561f3d759dd8', 'cjcis15a3f903f6259ad1c6c85c514',
       ...
       'cjcis15a3af382fec3e50db1185983', 'cjcis15a3af08ee946d90511c9b5c2',
       'cjcis15a3aeebffec3e50db11857ea', 'cjcis15a3aea70fec3e50db1185640',
       'cjcis15a3ae63771e4276922520ca7', 'cjcis15a3ae5480200ba077c8ab630',
       'cjcis15a3ade5ce946d90511c9af8d', 'cjcis15a3ade58e946d90511c9af8b',
       'cjcis15a3ad9650200ba077c8ab269', 'cjcis15a38ab866259ad0a9e317a88'],
      dtype='object', name='EPOPCON_ID', length=1109)

In [139]:
c = -1
for e_id in id_list.index:
    query = """
    select COUNT(*) as COUNT
    from MEUMS_COMP_REVISIT_HIS
    where EPOPCON_ID = '{}'
    """.format(e_id)
    
    count = pd.read_sql_query(query,revisit_engine)
    count = count.COUNT[0]
    if c < count:
        print(count, e_id)
        c = count

436 cjcis15a39507171e42756fbe7fff5
612 cjcis15a390ce45a93f40965bbf4b1
1996 cjcis15a39c58f6259ad0a9e33f62d
2057 cjcis15a3a50c8b267561f3d748ec8

<h1> cjcis15a3a50c8b267561f3d748ec8 case

In [69]:
query = """
select *
from MEUMS_COMP_REVISIT_HIS
where EPOPCON_ID = "cjcis15a3a50c8b267561f3d748ec8"
"""
user = pd.read_sql_query(query,revisit_engine)
user.head()

,ID,EPOPCON_ID,ES_ID,COMPANY_ID,TIMESTAMP,DEAL_DT,CARD_NAME,CARD_ID,CARD_APPR_NUM,PAYMENT,ISSUED_COMPANY_ID,DEAL_LOCATION,LIFEZONE_HIS_ID,TRANS_YN,REG_DT,UPT_DT
0,90196034,cjcis15a3a50c8b267561f3d748ec8,,5364271,1482246323000,2016-12-21 00:05:23,KB국민체크(6*4*),0,-1,5600,3,"0.0,0.0",-1,0,2017-12-20 21:02:50,2017-12-20 21:02:50
1,90196035,cjcis15a3a50c8b267561f3d748ec8,,5821922,1482285036000,2016-12-21 10:50:36,롯데카드(7*7*),0,-1,-320600,10,"0.0,0.0",-1,0,2017-12-20 21:02:50,2017-12-20 21:02:50
2,90196036,cjcis15a3a50c8b267561f3d748ec8,,5821922,1482316828000,2016-12-21 19:40:28,롯데카드(7*7*),0,-1,37505,10,"0.0,0.0",-1,0,2017-12-20 21:02:50,2017-12-20 21:02:50
3,90196037,cjcis15a3a50c8b267561f3d748ec8,,740666,1482398630000,2016-12-22 18:23:50,롯데카드(7*7*),0,-1,23570,10,"0.0,0.0",-1,0,2017-12-20 21:02:50,2017-12-20 21:02:50
4,90196038,cjcis15a3a50c8b267561f3d748ec8,,740666,1482398641000,2016-12-22 18:24:01,롯데카드(7*7*),0,-1,-23570,10,"0.0,0.0",-1,0,2017-12-20 21:02:50,2017-12-20 21:02:50

In [70]:
com = []
for co_id in user.COMPANY_ID.unique():
    query = """
    select ID,CO_NAME,CATE,CATE1
    from MEUMS_COMPANY
    where ID = {}""".format(co_id)
    
    df = pd.read_sql_query(query, company_engine)
    com.append(df)
len(com)

532

In [71]:
com2 = pd.concat([i for i in com])
com2.head()

        ID      CO_NAME   CATE  CATE1
0  5364271          카카오  금융/보험   간편결제
0  5821922  계절밥상 수원롯데몰점     외식     뷔페
0   740666          위메프  온라인쇼핑  온라인쇼핑
0    36087          G마켓  온라인쇼핑  온라인쇼핑
0  5403968   올리브영 수원인계점     뷰티    화장품

In [72]:
tosee = user.merge(com2, left_on="COMPANY_ID", right_on="ID").sort_values(["EPOPCON_ID", "DEAL_DT"])

In [73]:
tosee.to_csv("user_nonhyun.txt", sep="\t")

In [77]:
tosee.PAYMENT = tosee.PAYMENT.astype(int)

In [78]:
tosee2 = tosee[(tosee.DEAL_DT > '2018-04-01')&(tosee.DEAL_DT < '2018-05-01')]

In [79]:
tosee2["CARD"] = tosee2.CARD_NAME.str[:2]

C:\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [80]:
tosee2.groupby("CARD").PAYMENT.sum().to_csv("card_alter2.txt")

In [81]:
tosee2["hour"] = tosee2.DEAL_DT.dt.hour

C:\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [82]:
tosee2.groupby("hour").PAYMENT.sum().to_csv("time_alter2.txt")

In [83]:
tosee2.groupby('CATE').PAYMENT.sum().to_csv('cate_alter2.txt')

In [84]:
tosee2[tosee2.CATE == '카페/디저트'].CO_NAME.value_counts()

투썸플레이스 수원호매실점    10
투썸플레이스 평택소사벌점     4
뚜레쥬르              2
두보리팡 베이커리         1
투썸플레이스수원인계점       1
투썸플레이스 수원시청역점     1
뚜레쥬르수원권선점         1
스타벅스 오산IC DT점     1
투썸플레이스수원망포역점      1
스타벅스 판교역점         1
만화카페툰 수원일월점       1
Name: CO_NAME, dtype: int64

<h3>cjcis15a39bd3cb267560d56e54b27 case

In [146]:
query = """
select *
from MEUMS_COMP_REVISIT_HIS
where EPOPCON_ID = "cjcis15a3a50c8b267561f3d748ec8"
"""
user = pd.read_sql_query(query,revisit_engine)

com = []
for co_id in user.COMPANY_ID.unique():
    query = """
    select ID,CO_NAME,CATE,CATE1
    from MEUMS_COMPANY
    where ID = {}""".format(co_id)
    
    df = pd.read_sql_query(query, company_engine)
    com.append(df)

com2 = pd.concat([i for i in com])

tosee = user.merge(com2, left_on="COMPANY_ID", right_on="ID").sort_values(["EPOPCON_ID", "DEAL_DT"])
tosee.to_csv("user_nonhyun.txt", sep="\t")
tosee.PAYMENT = tosee.PAYMENT.astype(int)

tosee2 = tosee[(tosee.DEAL_DT > '2018-04-01')&(tosee.DEAL_DT < '2018-05-01')]
tosee2["CARD"] = tosee2.CARD_NAME.str[:2]
tosee2.groupby("CARD").PAYMENT.sum().to_csv("card_alter3.txt")
tosee2["hour"] = tosee2.DEAL_DT.dt.hour
tosee2.groupby("hour").PAYMENT.sum().to_csv("time_alter3.txt")
tosee2.groupby('CATE').PAYMENT.sum().to_csv('cate_alter3.txt')
tosee2[tosee2.CATE == '카페/디저트'].CO_NAME.value_counts().to_csv('cafe.txt')

C:\anaconda\lib\site-packages\ipykernel_launcher.py:25: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
C:\anaconda\lib\site-packages\ipykernel_launcher.py:27: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [98]:
tosee.sort_values("COMPANY_ID").COMPANY_ID.unique()

array([   3668,    5307,    7759,   14366,   15331,   24149,   36087,
         70459,  101809,  104973,  111690,  112493,  145336,  208050,
        208227,  208356,  218262,  261407,  280387,  286264,  286550,
        288098,  298561,  305899,  305912,  306072,  306215,  306278,
        306690,  307343,  313278,  317437,  331101,  331226,  331236,
        331256,  334596,  361017,  372056,  376354,  390640,  396057,
        408304,  411042,  412292,  429629,  483696,  492197,  494626,
        505452,  507512,  516691,  519924,  519928,  556030,  557887,
        561856,  562058,  576348,  578714,  578987,  580192,  580443,
        587170,  607464,  618636,  646479,  692036,  695183,  725784,
        739768,  748254,  755299,  761108,  762693,  762748,  768189,
        774945,  780053,  822058,  838916,  912897,  913911,  950788,
        953122,  953636, 1013603, 1025153, 1036397, 1049531, 1049841,
       1062371, 1062388, 1062416, 1074001, 2588165, 2618822, 2695049,
       2766183, 2904727, 2972149, 3028361, 3235300, 3345452, 3612008,
       3642111, 3728130, 3814836, 4225311, 4225318, 4249559, 4294220,
       4330240, 4335102, 4335126, 4337811, 4348391, 4348424, 4348645,
       4349090, 4370914, 4390895, 4397860, 4420093, 4420150, 4421696,
       4503782, 4760803, 4895818, 4919066, 4942718, 4956079, 5004802,
       5007883, 5009650, 5012077, 5022720, 5052600, 5155940, 5172770,
       5192673, 5355526, 5399420, 5404201, 5418146, 5419459, 5513050,
       5597980, 5749601, 5764329, 5780627, 5813118, 5815824, 5821973,
       5829365, 5850296, 5854337, 5856179, 5856182, 5856189, 5857306,
       5857368, 5857390, 5857687, 5860056, 5860244, 5865725, 5878859,
       5881347, 5882348, 5883473, 5883519, 5888571, 5888894, 5889136,
       5891226, 5900089, 5911842, 5912211, 5913508, 5921603, 5929891,
       5938120, 5957690, 6032218, 6054756, 6075900, 6076717, 6083344,
       6106084, 6107602, 6213843, 6307890, 6317386, 6354365, 6397358,
       6424112, 6531909, 6531929, 6553238, 6554951, 6555001, 6577184,
       6579743, 6594895, 6596167, 6603394, 6605819, 6615153, 6628338,
       6639776, 6650503, 6653932, 6663990, 6740024, 6748028, 6754930,
       6807033, 6807121, 6807139, 6845999, 6858408, 6860555, 6887878,
       6895297, 6910411, 6925049, 6972448, 6990757, 7040037, 7068890,
       7076722, 7115094, 7153352, 7174649, 7174696, 7192715, 7245217,
       7245768, 7248043, 7284267, 7321973, 7326655, 7336988, 7362040,
       7362797, 7372175, 7441212, 7484519, 7489235, 7512747, 7530633,
       7555117, 7563157, 7615251, 7705179, 7736625, 7738075, 7739889,
       7752629, 7772682, 7775700, 7776647, 7781383, 7789758, 7791128,
       7791143, 7795286, 7797244, 7797369, 7799397, 7800187, 7825741,
       7842224, 7844723, 7869206, 7870806, 7875656, 7875946, 7880415,
       7898591, 7899263, 7904833, 7916674, 7943559, 7963303, 7968137,
       7970510, 7981495, 7987843, 8008431, 8027871, 8028191, 8030883,
       8056269, 8056624, 8059608, 8068916, 8078294, 8078344, 8080792,
       8082523, 8090148, 8091887, 8099535, 8100224, 8102979, 8104692,
       8104986, 8113946, 8116996, 8123792, 8129564, 8148412, 8268588,
       8269094, 8286678, 8294056, 8414158], dtype=int64)